qcaml-tools/_build/default/qcaml/common/test/bitstring.ml
(* Tests header                                                    :noexport: *)


(* [[file:~/QCaml/common/bitstring.org::*Tests%20header][Tests header:1]] *)
open Common.Bitstring
let check_bool = Alcotest.(check bool)
let check msg x = check_bool msg true x
let test_all () =
  let x = 8745687 in
  let one_x  = of_int x in
  let z = Z.shift_left (Z.of_int x) 64 in
  let many_x = of_z z in
(* Tests header:1 ends here *)

(* [[file:~/QCaml/common/bitstring.org::*General%20implementation][General implementation:3]] *)
