qcaml-tools/_build/default/qcaml/common/bitstring.org
** Printers

   #+begin_src ocaml :tangle (eval mli)
val pp : Format.formatter -> t -> unit
   #+end_src

   #+begin_src ocaml :tangle (eval ml) :exports none
let pp ppf = function
  | One x -> One.pp ppf x
  | Many x -> Many.pp ppf x
   #+end_src

** Tests                                                           :noexport:

   #+begin_src ocaml :tangle (eval test-ml) :exports none
()

let tests = [
  "all", `Quick, test_all;
]
   #+end_src
