qcaml-tools/_build/default/qcaml/common/lib/bitstring.ml
let pp ppf = function
  | One x -> One.pp ppf x
  | Many x -> Many.pp ppf x
(* Printers:2 ends here *)
