qcaml-tools/_build/default/qcaml/common/lib/bitstring.mli
val pp : Format.formatter -> t -> unit
(* Printers:1 ends here *)
