qcaml-tools/_build/default/qcaml/common/test/bitstring.ml
  "all", `Quick, test_all;
]
(* Tests:1 ends here *)
